## **Handling Date and Time**

In [30]:
import numpy as np
import pandas as pd

In [31]:
orders_df = pd.read_csv("D:/Academics/AI/Simplilearn/Data Sets/CampusX/Orders.csv")

In [32]:
orders_df.head()

         date  product_id  city_id  orders
0  10-12-2019        5628       25       3
1  15-08-2018        3646       14     157
2  23-10-2018        1859       25       1
3  17-08-2019        7292       25       1
4  06-01-2019        4344       25       3

In [33]:
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

Here the date column is of the 'object' data type so first we have to convert it into 'datatime' datatype.

------------------------------------------------------------------------
**Converting to datetime datatype**

In [34]:
orders_df['date'] = pd.to_datetime(orders_df['date'], format='%d-%m-%Y')

Here, date strings in the date column are not in the format that pd.to_datetime() expects. The default format for pd.to_datetime() is %m/%d/%Y, but the date strings are in the format %d-%m-%Y.  To fix the error we are using the format parameter - **format='%d-%m-%Y'**

-------------------------------------------------------------------------------------------

In [35]:
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

**Now the date column is converted into datetime datatype**

-------------------------------------------------------------------------------

**Extracting Year from the Date**

In [36]:
orders_df['Year'] = orders_df['date'].dt.year

In [37]:
orders_df.head()

        date  product_id  city_id  orders  Year
0 2019-12-10        5628       25       3  2019
1 2018-08-15        3646       14     157  2018
2 2018-10-23        1859       25       1  2018
3 2019-08-17        7292       25       1  2019
4 2019-01-06        4344       25       3  2019

**Extracting Month**

In [38]:
orders_df['Month'] = orders_df['date'].dt.month

In [39]:
orders_df.head()

        date  product_id  city_id  orders  Year  Month
0 2019-12-10        5628       25       3  2019     12
1 2018-08-15        3646       14     157  2018      8
2 2018-10-23        1859       25       1  2018     10
3 2019-08-17        7292       25       1  2019      8
4 2019-01-06        4344       25       3  2019      1

In [40]:
orders_df['Month Name'] = orders_df['date'].dt.month_name()

In [41]:
orders_df.head()

        date  product_id  city_id  orders  Year  Month Month Name
0 2019-12-10        5628       25       3  2019     12   December
1 2018-08-15        3646       14     157  2018      8     August
2 2018-10-23        1859       25       1  2018     10    October
3 2019-08-17        7292       25       1  2019      8     August
4 2019-01-06        4344       25       3  2019      1    January

In [42]:
orders_df['DOW'] = orders_df['date'].dt.day_name()

In [43]:
orders_df.head()

        date  product_id  city_id  orders  Year  Month Month Name        DOW
0 2019-12-10        5628       25       3  2019     12   December    Tuesday
1 2018-08-15        3646       14     157  2018      8     August  Wednesday
2 2018-10-23        1859       25       1  2018     10    October    Tuesday
3 2019-08-17        7292       25       1  2019      8     August   Saturday
4 2019-01-06        4344       25       3  2019      1    January     Sunday

In [44]:
orders_df['Week no'] = orders_df['date'].dt.week

AttributeError: 'DatetimeProperties' object has no attribute 'week'

We were getting this error because the week attribute was added to DatetimeProperties in pandas version 1.2.0. We might be using older version of pandas.
The following code will get the week number - **dt.isocalendar().week**

In [45]:
orders_df['Week no'] = orders_df['date'].dt.isocalendar().week

In [46]:
orders_df.head()

,date,product_id,city_id,orders,Year,Month,Month Name,DOW,Week no
0,2019-12-10,5628,25,3,2019,12,December,Tuesday,50
1,2018-08-15,3646,14,157,2018,8,August,Wednesday,33
2,2018-10-23,1859,25,1,2018,10,October,Tuesday,43
3,2019-08-17,7292,25,1,2019,8,August,Saturday,33
4,2019-01-06,4344,25,3,2019,1,January,Sunday,1

**Time related operations**

In [49]:
import datetime
today = datetime.datetime.today()
today

datetime.datetime(2023, 11, 26, 19, 12, 54, 984106)

In [50]:
today - orders_df['date']

0     1447 days 19:12:54.984106
1     1929 days 19:12:54.984106
2     1860 days 19:12:54.984106
3     1562 days 19:12:54.984106
4     1785 days 19:12:54.984106
                 ...
995   1875 days 19:12:54.984106
996   1816 days 19:12:54.984106
997   1664 days 19:12:54.984106
998   1729 days 19:12:54.984106
999   1503 days 19:12:54.984106
Name: date, Length: 1000, dtype: timedelta64[ns]

**To calculate the difference between two dates in terms of days**

In [51]:
(today - orders_df['date']).dt.days.head()

0    1447
1    1929
2    1860
3    1562
4    1785
Name: date, dtype: int64

**To calculate how many months have passed**

In [53]:
np.round((today - orders_df['date']) / np.timedelta64(1, 'W'))

0      207.0
1      276.0
2      266.0
3      223.0
4      255.0
       ...
995    268.0
996    260.0
997    238.0
998    247.0
999    215.0
Name: date, Length: 1000, dtype: float64

In [54]:
np.round((today - orders_df['date']).dt.days / 30.44, 0)

0      48.0
1      63.0
2      61.0
3      51.0
4      59.0
       ...
995    62.0
996    60.0
997    55.0
998    57.0
999    49.0
Name: date, Length: 1000, dtype: float64

In [55]:
messages_df = pd.read_csv('D:/Academics/AI/Simplilearn/Data Sets/CampusX/Messages.csv')

In [56]:
messages_df.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [57]:
messages_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

**As we can see the date column is object datatype so we have to convert it to datetime datatype**

In [58]:
messages_df['date'] = pd.to_datetime(messages_df['date'])

In [59]:
messages_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

**Extracting Time**

In [60]:
messages_df['Time'] = messages_df['date'].dt.time

In [61]:
messages_df.head()

,date,msg,Time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23:11:00

In [62]:
messages_df['Date'] = messages_df['date'].dt.date

In [63]:
messages_df.head()

,date,msg,Time,Date
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,00:50:00,2013-12-15
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23:40:00,2014-04-29
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,00:21:00,2012-12-30
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,00:31:00,2014-11-28
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23:11:00,2013-10-26

**Calculating the Time difference**

In [74]:
messages_df['Date'] = pd.to_datetime(messages_df['Date'])

In [75]:
today - messages_df['Date']

0     3633 days 19:12:54.984106
1     3498 days 19:12:54.984106
2     3983 days 19:12:54.984106
3     3285 days 19:12:54.984106
4     3683 days 19:12:54.984106
                 ...
995   4272 days 19:12:54.984106
996   3594 days 19:12:54.984106
997   4059 days 19:12:54.984106
998   4175 days 19:12:54.984106
999   3447 days 19:12:54.984106
Name: Date, Length: 1000, dtype: timedelta64[ns]

In [68]:
(today - messages_df['date'])/np.timedelta64(1, 's')

0      3.139574e+08
1      3.022112e+08
2      3.441991e+08
3      2.838913e+08
4      3.181969e+08
           ...
995    3.691670e+08
996    3.105071e+08
997    3.506818e+08
998    3.607043e+08
999    2.978057e+08
Name: date, Length: 1000, dtype: float64